Revit 2016 API
RenderingQualitySettings.RenderingQuality Property
 The quality applied for rendering.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2013
Syntax
C#
public RenderingQuality RenderingQuality { get; set; }
Visual Basic
Public Property RenderingQuality As RenderingQuality
	Get
	Set
Visual C++
public:
property RenderingQuality RenderingQuality {
	RenderingQuality get ();
	void set (RenderingQuality value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace